<?php

return [
    "home" => "الرئيسية",
    "title" => "المتصفح",
    "back" => "الرجوع",
    "save" => "حفظ",
    "empty" => "عفواً لا يوجد ملفات أو مجلدات هنا.",
    "group" => "الإعدادت",
    "files" => [
        "columns" => [
            "name" => "الإسم",
        ]
    ],
    "actions" => [
        "create" => "ملف جديد",
        "rename" => "إعادة تسمية",
        "delete" => "حذف",
        "home" => "الرئيسية",
        "back" => "الرجوع"
    ],
    "notifications" => [
        "saved" => 'تم حفظ الملف بنجاح!',
        "deleted" => 'تم حذف الملف بنجاح!',
        "renamed" => 'تم إعادة تسمية الملف بنجاح!',
        "file-exists" => 'الملف موجود بالفعل!',
        "folder-exists" => 'المجلد موجود بالفعل!',
        "uploaded" => 'تم رفع الملف بنجاح!',
        "created" => 'تم إنشاء الملف بنجاح!',
    ],
    "edit" => [
        "content" => "المحتوى",
    ],
    "create" => [
        "type" => "نوع الملف",
        "name" => "الإسم",
        "extension" => "الإمتداد",
        "file" => "الملف",
        "code" => "الكود",
        "markdown" => "المحتوى",
    ],
    "types" => [
        "code" => "كود",
        "folder" => "مجلد",
        "upload" => "رفع ملف",
        "markdown" => "مارك داون",
    ]
];
